src/zuul/cluster_test.org
#+TITLE: 网关集群测试
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: single_test.html   
#+HTML_LINK_HOME: zuul_test.html
#+OPTIONS: num:nil timestamp:nil 

* 网关hello world服务
在kubernates集群环境下分别使用1个节点，2个节点，3个节点测试网关的zuul服务，每次测试使用500并发连接，测试时间为1分钟
   #+BEGIN_SRC sh
     [root@centos-master ~]$ wrk -c500 -t6 -d1m http://172.25.16.171/gw/hw --latency
   #+END_SRC

   #+CAPTION: 集群环境网关hello world服务
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      | 1个节点 | 2个节点 | 3个节点 |
   | 发送总请求数              |  136383 |  263288 |  400448 |
   | 总时间(s)                 |      60 |      60 |      60 |
   | 平均请求时间(ms)          |  235.76 |  194.79 |   80.98 |
   | 请求时间中位数（50%<)(ms) |  119.94 |   85.59 |   72.22 |
   | 请求时间90%< (ms)         |  629.04 |  576.60 |  135.27 |
   | 最大请求时间(ms)          |    2000 |    2000 |  934.62 |
   | Error                     |    3090 |    1383 |       0 |
   | QPS(请求数/秒)            | 2269.56 | 4380.98 | 6664.67 |

* 集群环境测试总结

+ 吞吐量随着节点部署数量的提升而提升显著
+ 延迟随着节点部署数量的提升明显降低
+ 500并发量对于每个节点过高，kubernates的负载均衡器会报错，随着节点数目的增加，每个节点承担的并发数减少，错误消失
    + 安全的值是：每个节点承受100-150并发

总之kubernates集群方案能很好地支持横向扩展

[[file:stablity_test.org][Next：可靠性测试结果]]

[[file:single_test.org][Previous：单节点测试结果]]

[[file:zuul_test.org][Home：目录]]
