html/zuul/cluster_test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>网关集群测试</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="single_test.html"> UP </a>
 |
 <a accesskey="H" href="zuul_test.html"> HOME </a>
</div><div id="content">
<h1 class="title">网关集群测试</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">集群环境测试网关hello world服务</a></li>
<li><a href="#sec-2">集群环境测试总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">集群环境测试网关hello world服务</h2>
<div class="outline-text-2" id="text-1">
<p>
在kubernates集群环境下分别使用1个节点，2个节点，3个节点测试网关的zuul服务，每次测试使用500并发连接，测试时间为1分钟
</p>
<div class="org-src-container">

<pre class="src src-sh">[root@centos-master ~]$ wrk -c500 -t6 -d1m http://172.25.16.171/gw/hw --latency
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> 集群环境网关hello world服务</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1个节点</td>
<td class="right">2个节点</td>
<td class="right">3个节点</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">136383</td>
<td class="right">263288</td>
<td class="right">400448</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">60</td>
<td class="right">60</td>
<td class="right">60</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">235.76</td>
<td class="right">194.79</td>
<td class="right">80.98</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">119.94</td>
<td class="right">85.59</td>
<td class="right">72.22</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">629.04</td>
<td class="right">576.60</td>
<td class="right">135.27</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">2000</td>
<td class="right">2000</td>
<td class="right">934.62</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">3090</td>
<td class="right">1383</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">2269.56</td>
<td class="right">4380.98</td>
<td class="right">6664.67</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">集群环境测试总结</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>吞吐量随着节点部署数量的提升而提升显著
</li>
<li>延迟随着节点部署数量的提升明显降低
</li>
<li>500并发量对于每个节点过高，kubernates的负载均衡器会报错，随着节点数目的增加，每个节点承担的并发数减少，错误消失
<ul class="org-ul">
<li>安全的值是：每个节点承受100-150并发
</li>
</ul>
</li>
</ul>

<p>
总之kubernates集群方案能很好地支持横向扩展
</p>

<p>
<a href="stablity_test.html">Next：可靠性测试结果</a>
</p>

<p>
<a href="single_test.html">Previous：单节点测试结果</a>
</p>

<p>
<a href="zuul_test.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
